/************************************************************************************************************************
**                                                                                                                     ** 
**                                                      Serial 2.7                                                     ** 
**                 Quan carreguem el programa amb el número 32767 i li sumem 1 ens dona -32768                         **
**                 en comptes de 32768. Això és degut a que hem començat a usar el 8è bit, el de signe.                **
**                 Això provoca que el bit de signesigui 1 i per tant el nombre és negatiu                             **                                                                                                        
************************************************************************************************************************/

//*********** Includes  ********************************************************************************



//***********  Variables  *******************************************************************************
int test = 32767;

//***********  Setup  ************************************************************************************
void setup() {
  Serial.begin(9600);
  Serial.print("Test value is: ");
  Serial.println(test);
  
  test = test + 1;
  
  Serial.print("Now it is ");
  Serial.println(test);
                  
}

//***********  Loop  **************************************************************************************
void loop() {
  
}
  

